khuongduy-cyber/smart-lock-stm32-esp32s3/ESP32S3_FaceLock/app_httpd.cpp
static int rgb_printf(fb_data_t *fb, uint32_t color, const char *format, ...)
{
    char loc_buf[64];
    char *temp = loc_buf;
    int len;
    va_list arg;
    va_list copy;
    va_start(arg, format);
    va_copy(copy, arg);
    len = vsnprintf(loc_buf, sizeof(loc_buf), format, arg);
    va_end(copy);
    if (len >= sizeof(loc_buf))
    {
        temp = (char *)malloc(len + 1);
        if (temp == NULL)
        {
            return 0;
        }
    }
    vsnprintf(temp, len + 1, format, arg);
    va_end(arg);
    rgb_print(fb, color, temp);
    if (len > 64)
    {
        free(temp);
    }
    return len;
}
static uint8_t *rotateRGB888CCW(
    const uint8_t *src,
    int srcWidth,
    int srcHeight
)
{
    size_t len =
        (size_t)srcWidth *
        srcHeight *
        3;

    uint8_t *dst =
        (uint8_t *)ps_malloc(len);

    if (dst == NULL)
    {
        Serial.println(
            "[CAM] Rotate buffer allocation failed"
        );

        return NULL;
    }

    for (int y = 0; y < srcHeight; y++)
    {
        for (int x = 0; x < srcWidth; x++)
        {
            int newX = y;
            int newY = srcWidth - 1 - x;

            size_t srcIndex =
                ((size_t)y * srcWidth + x) * 3;

            size_t dstIndex =
                ((size_t)newY * srcHeight + newX) * 3;

            dst[dstIndex]     = src[srcIndex];
            dst[dstIndex + 1] = src[srcIndex + 1];
            dst[dstIndex + 2] = src[srcIndex + 2];
        }
    }

    return dst;
}
#endif
static void draw_face_boxes(fb_data_t *fb, std::list<dl::detect::result_t> *results, int face_id)
{
    int x, y, w, h;
    uint32_t color = FACE_COLOR_YELLOW;
    if (face_id < 0)
    {
        color = FACE_COLOR_RED;
    }
    else if (face_id > 0)
    {
        color = FACE_COLOR_GREEN;
    }
    if(fb->bytes_per_pixel == 2){
        //color = ((color >> 8) & 0xF800) | ((color >> 3) & 0x07E0) | (color & 0x001F);
        color = ((color >> 16) & 0x001F) | ((color >> 3) & 0x07E0) | ((color << 8) & 0xF800);
    }
    int i = 0;
    for (std::list<dl::detect::result_t>::iterator prediction = results->begin(); prediction != results->end(); prediction++, i++)
    {
        // rectangle box
        x = (int)prediction->box[0];
        y = (int)prediction->box[1];
        w = (int)prediction->box[2] - x + 1;
        h = (int)prediction->box[3] - y + 1;
        if((x + w) > fb->width){
            w = fb->width - x;
        }
        if((y + h) > fb->height){
            h = fb->height - y;
        }
        fb_gfx_drawFastHLine(fb, x, y, w, color);
        fb_gfx_drawFastHLine(fb, x, y + h - 1, w, color);
        fb_gfx_drawFastVLine(fb, x, y, h, color);
        fb_gfx_drawFastVLine(fb, x + w - 1, y, h, color);
#if TWO_STAGE
        // landmarks (left eye, mouth left, nose, right eye, mouth right)
        int x0, y0, j;
        for (j = 0; j < 10; j+=2) {
            x0 = (int)prediction->keypoint[j];
            y0 = (int)prediction->keypoint[j+1];
            fb_gfx_fillRect(fb, x0, y0, 3, 3, color);
        }
#endif
    }
}

#if CONFIG_ESP_FACE_RECOGNITION_ENABLED
static int run_face_recognition(fb_data_t *fb, std::list<dl::detect::result_t> *results)
{
    if (face_recog_mutex == NULL) {
        face_recog_mutex = xSemaphoreCreateMutex();
    }

    if (face_recog_mutex != NULL) {
        xSemaphoreTake(face_recog_mutex, portMAX_DELAY);
    }

    std::vector<int> landmarks = results->front().keypoint;

    Tensor<uint8_t> tensor;
    tensor
        .set_element((uint8_t *)fb->data)
        .set_shape({fb->height, fb->width, 3})
        .set_auto_free(false);

    int enrolled_count = recognizer.get_enrolled_id_num();

    // =====================================================
    // ENROLL
    // Kiem tra khuon mat da ton tai TRUOC khi tao ID moi
    // =====================================================
    if (is_enrolling)
    {
        if (enrolled_count > 0)
        {
            face_info_t existing =
                recognizer.recognize(tensor, landmarks);

            if (existing.id >= 0)
            {
                is_enrolling = false;

                rgb_printf(
                    fb,
                    FACE_COLOR_YELLOW,
                    "EXISTS ID[%u]",
                    existing.id
                );

                Serial.printf(
                    "[FACE] ALREADY EXISTS - ID=%d similarity=%.3f\n",
                    existing.id,
                    existing.similarity
                );

                if (face_recog_mutex != NULL) {
                    xSemaphoreGive(face_recog_mutex);
                }

                return existing.id;
            }
        }

        // Chua ton tai -> moi tao Face ID
        if (enrolled_count < FACE_ID_SAVE_NUMBER)
        {
            int newID =
                recognizer.enroll_id(
                    tensor,
                    landmarks,
                    "",
                    true
                );

            ESP_LOGI(
                TAG,
                "Enrolled ID: %d",
                newID
            );

            if (newID >= 0)
            {
                is_enrolling = false;

            

                rgb_printf(
                    fb,
                    FACE_COLOR_CYAN,
                    "NEW ID[%u]",
                    newID
                );

                Serial.printf(
                    "[FACE] NEW FACE - ID=%d\n",
                    newID
                );

                if (face_recog_mutex != NULL) {
                    xSemaphoreGive(face_recog_mutex);
                }

                return newID;
            }
        }
        else
        {
            is_enrolling = false;

            rgb_print(
                fb,
                FACE_COLOR_RED,
                "Face DB Full"
            );

            Serial.println(
                "[FACE] DATABASE FULL"
            );

            if (face_recog_mutex != NULL) {
                xSemaphoreGive(face_recog_mutex);
            }

            return -1;
        }
    }

