khuongduy-cyber/smart-lock-stm32-esp32s3/ESP32S3_FaceLock/app_httpd.cpp
    // =====================================================
    // NORMAL RECOGNITION
    // =====================================================
    if (!faceUnlockArmed &&
    millis() - lastFacePresenceTime >= FACE_REARM_TIME)
{
    faceUnlockArmed = true;
    Serial.println("[FACE] Ready for next unlock");
}
    uint32_t authStartMs = millis();

    face_info_t recognize =
        recognizer.recognize(
            tensor,
            landmarks
        );

    uint32_t authTimeMs =
        millis() - authStartMs;

    lastRecognitionSimilarity =
        recognize.similarity;

    if (recognize.id >= 0)
    {
        

        rgb_printf(
            fb,
            FACE_COLOR_GREEN,
            "ID[%u]: %.2f",
            recognize.id,
            recognize.similarity
        );

        Serial.printf(
            "[FACE] MATCH ID=%d similarity=%.3f\n",
            recognize.id,
            recognize.similarity
        );
        lastFacePresenceTime = millis();

        if (allowFaceAutoUnlock && faceUnlockArmed)
        {
            faceUnlockArmed = false;

            Serial.println();
            Serial.println("================================");
            Serial.printf(
                "[FACE] ACCESS GRANTED - ID=%d\n",
                recognize.id
            );
            Serial.println("[FACE] OPEN DOOR");
            Serial.println("================================");

            unlockDoor();

            recordFaceAccess(
                recognize.id,
                authTimeMs,
                recognize.similarity
            );
        }
    }
    else
    {
        rgb_print(
            fb,
            FACE_COLOR_RED,
            "Unknown Face"
        );

        Serial.printf(
            "[FACE] UNKNOWN similarity=%.3f\n",
            recognize.similarity
        );

        if (allowFaceAutoUnlock)
        {
            reportUnknownFace(
                recognize.similarity,
                authTimeMs
            );
        }
    }

    if (face_recog_mutex != NULL) {
        xSemaphoreGive(face_recog_mutex);
    }

    return recognize.id;
}

// -----------------------------------------------------------------------------
// Public one-shot recognition function used by CameraWebServer.ino when BOOT is
// pressed. Camera should stay at <= 400 px width (QVGA is recommended).
// Returns true only when the captured face matches an enrolled face.
// -----------------------------------------------------------------------------
bool recognizeFaceOnce()
{
    uint32_t oneShotStartMs = millis();

    lastOneShotAuthTimeMs = 0;
    lastOneShotFaceID = -1;
    lastOneShotFaceSimilarity = 0.0f;
    lastOneShotFaceDetected = false;

    if (recognizer.get_enrolled_id_num() <= 0)
    {
        Serial.println(
            "[FACE] No enrolled face in flash"
        );

        return false;
    }

    // Thu toi da 3 frame, nhung dung som de bam muc tieu duoi 1 giay
    for (int attempt = 1; attempt <= 3; attempt++)
    {
        if (
            millis() - oneShotStartMs >=
            FACE_AUTH_TARGET_MS
        )
        {
            break;
        }

        uint32_t attemptStartMs = millis();

        Serial.printf(
            "[FACE] Recognition attempt %d/3\n",
            attempt
        );

        camera_fb_t *fb =
            esp_camera_fb_get();

        if (!fb)
        {
            Serial.println(
                "[FACE] Camera capture failed"
            );

            delay(20);
            continue;
        }

        if (fb->width > 400)
        {
            Serial.printf(
                "[FACE] Frame too large: %ux%u\n",
                fb->width,
                fb->height
            );

            esp_camera_fb_return(fb);
            delay(20);
            continue;
        }

        size_t out_len =
            fb->width *
            fb->height *
            3;

        int out_width = fb->width;
        int out_height = fb->height;

        uint8_t *out_buf =
            (uint8_t *)malloc(out_len);

        if (!out_buf)
        {
            Serial.println(
                "[FACE] RGB buffer allocation failed"
            );

            esp_camera_fb_return(fb);
            delay(20);
            continue;
        }

        bool converted =
            fmt2rgb888(
                fb->buf,
                fb->len,
                fb->format,
                out_buf
            );

        esp_camera_fb_return(fb);

        if (!converted)
        {
            Serial.println(
                "[FACE] JPEG -> RGB888 conversion failed"
            );

            free(out_buf);
            delay(20);
            continue;
        }

        // Xoay anh 90 do cho dung chieu
        uint8_t *rotated =
            rotateRGB888CCW(
                out_buf,
                out_width,
                out_height
            );

        if (rotated == NULL)
        {
            free(out_buf);
            delay(20);
            continue;
        }

        free(out_buf);
        out_buf = rotated;

        int oldWidth = out_width;

        out_width = out_height;
        out_height = oldWidth;

        out_len =
            out_width *
            out_height *
            3;

#if TWO_STAGE
        HumanFaceDetectMSR01 s1(
            0.1F,
            0.5F,
            10,
            0.2F
        );

        HumanFaceDetectMNP01 s2(
            0.5F,
            0.3F,
            5
        );

        std::list<dl::detect::result_t> &candidates =
            s1.infer(
                (uint8_t *)out_buf,
                {out_height, out_width, 3}
            );

        std::list<dl::detect::result_t> &results =
            s2.infer(
                (uint8_t *)out_buf,
                {out_height, out_width, 3},
                candidates
            );
#else
        HumanFaceDetectMSR01 s1(
            0.3F,
            0.5F,
            10,
            0.2F
        );

        std::list<dl::detect::result_t> &results =
            s1.infer(
                (uint8_t *)out_buf,
                {out_height, out_width, 3}
            );
#endif

